
def make_number_words(num):
    """Принимает число от 1 по 99 и делает его описание словами"""

    if num not in range(1, 100):
        return 'Ошибка ввода'

    number = {1: 'один', 2: 'два', 3: 'три', 4: 'четыре', 5: 'пять',
              6: 'шесть', 7: 'семь', 8: 'восемь', 9: 'девять'}
    
    tens = {10: 'десять', 20: 'двадцать', 30: 'тридцать', 40: 'сорок', 50: 'пятьдесят', 
            60: 'шестьдесят', 70: 'семьдесят', 80: 'восемьдесят', 90: 'девяносто'}
    
    eleven = {11: 'одиннадцать', 12: 'двенадцать', 13: 'тринадцать',
              14: 'четырнадцать', 15: 'пятнадцать', 16: 'шестнадцать',
              17: 'семнадцать', 18: 'восемнадцать', 19: 'девятнадцать'}
    
    n_1 = num % 10
    n_2 = num - n_1
    
    if num < 10:
        return number[num]
    elif 10 < num < 20:
        return eleven[num]
    elif num >= 10 and num in tens:
        return tens[num]
    else:
        return f"{tens[n_2]} {number[n_1]}"


num = int(input())
print(make_number_words(num))